{
    "homepage": {
        "return_button": "Torna alla Homepage",
        "privacy-banner": "Questo sito sfrutta il localstorage per salvare le tue preferenze, non verranno richiesti dati personali e non è previsto l'uso dei cookies"
    },
    "about_me": {
        "title": "Chi sono",
        "intro": "Un'occhiata al mio percorso, tra codice e passioni",
        "bio":[
            {
                "title": "Background e formazione",
                "text": "La mia avventura nel mondo dello sviluppo è iniziata a 15 anni, quando HTML4 e CSS2 dominavano la scena digitale. I primi passi li ho fatti creando componenti per i portali su ForumFree, ForumCommunity e, di tanto in tanto, anche su MySpace. \n Nel 2020 ho preso una decisione significativa: iscrivermi al corso di Boolean Careers, che prometteva di formare Full Stack Web Developer da zero.\n\nDa quel momento, la mia passione per il coding si è trasformata in un percorso di formazione strutturato. Durante il corso ho acquisito competenze approfondite e, successivamente, ho scelto di specializzarmi nel frontend, completando ulteriori corsi, tra cui due focalizzati sul SEO. Dal 2021, ho avuto l'opportunità di lavorare in team su progetti Angular, che ad oggi considero il mio cavallo di battaglia.\n\nQuesto percorso di crescita continua è alimentato dalla curiosità e dalla voglia di apprendere sempre di più nel vasto universo dello sviluppo web, per cui sto continuando a seguire corsi dedicati. La creazione di questo portfolio nasce anche dalla mia volontà di mettere in pratica ciò che ho imparato negli ultimi anni. Il passaggio dal lavoro in team al lavoro individuale mi ha permesso di approfondire parti di Angular solitamente gestite da altri colleghi."
            },
            {
                "title": "Filosofia di lavoro",
                "text": "Nel mio approccio al lavoro, sono sempre alla ricerca di nuovi spunti e soluzioni nel mondo dello sviluppo web. Mi piace confrontarmi con diverse prospettive e chiedere il parere di colleghi e amici, e recentemente ho trovato in ChatGPT un ottimo compagno di studi, capace di consigliarmi come approcciarmi a diverse situazioni e allo stesso tempo in grado di crearmi degli esercizi per migliorare le mie competenze.\n\nDurante il mio percorso, ho adottato come mantra una semplice affermazione di uno dei miei docenti in Boolean, che il primo giorno quasi per caso disse 'Sempre formarsi'. Solo due parole, che però mi segnai subito nel mio quaderno e che ancora mi porto dietro, un promemoria costante a mantenere vivo il desiderio di apprendere e crescere professionalmente."
            },
            {
                "title": "Obiettivi futuri",
                "text": "Nel corso del 2021 ho iniziato un corso su React, ma a causa di alcune dinamiche lavorative ho dovuto interromperlo, anche se mi piacerebbe riprenderlo e usarlo per un paio di progetti personali, considerandolo una tecnologia di grande rilevanza nel mondo dello sviluppo web. Sono certo che sarebbe un'importante freccia al mio arco. \n\nInoltre, mi piacerebbe anche approfondire l'ambito dell'UX/UI; la progettazione dell'esperienza utente e dell'interfaccia è un elemento cruciale per il successo di qualsiasi progetto, e ritengo che investire del tempo in questo settore possa contribuire significativamente alla mia crescita professionale, dato che i frontendisti lavorano a stretto contatto con i web designer."
            },
            {
                "title": "Hobby",
                "text": "Al di fuori del mondo del coding, trovo il mio rifugio nella lettura, esplorando generi come fantasy, fantascienza, storici e gialli, e ultimamente ho riscoperto con piacere i libri gioco.\nAmo i giochi da tavolo, pratico scherma rinascimentale, pesca sportiva, trekking e tiro con l'arco.\nE ovviamente non possono mancare i miei gatti, compagni più che preziosi nel tempo che passo a casa, nonché assidui controllori di praticamente qualsiasi faccenda domestica, quando non cercano di mangiarmi il cavo del mouse."
            }
        ]
    },
    "projects": {
        "title": "Progetti",
        "intro": "Esplora il mio percorso nel mondo dello sviluppo web attraverso i progetti che ho realizzato",
        "visit_the_site": "Visita il sito",
        "explore_the_code": "Esplora il codice"
    },
    "certificates": {
        "title": "Attestati",
        "intro": "Scopri i riconoscimenti che testimoniano il mio impegno costante e la crescita nel settore",
        "download_file": "Scarica l'attestato"
    },
    "details": {
        "title": "Dietro le quinte",
        "intro": "Esplora il backstage del mio portfolio: curiosità e scelte di sviluppo",
        "timeline": [
            {
                "title": "Il mio portfolio: powered by Angular",
                "text": "La scelta di sviluppare questo portfolio con Angular mira ad evidenziare le mie competenze come sviluppatore. Angular offre un ambiente robusto e scalabile, permettendomi di mostrare appieno le mie abilità nella creazione di progetti web avanzati e dinamici."
            },
            {
                "title": "L'arsenale di sviluppo",
                "text": "La creazione di questo portfolio ha richiesto un'orchestrazione precisa di linguaggi e tecnologie per garantire un'esperienza utente fluida e coinvolgente. \n La struttura solida è stata costruita con HTML5, lo stile curato con CSS3 e SCSS per una gestione avanzata dei fogli di stile, ed infine, TypeScript conferisce affidabilità e robustezza al codice. \n\n Per rendere il portfolio accessibile ad un pubblico internazionale, ho implementato la gestione del multilingua tramite la libreria ngx-translate, consentendo una traduzione fluida del contenuto in italiano e inglese. \nLe form, essenziali per l'interazione, sono gestite con precisione attraverso emailJS, garantendo una consegna sicura dei messaggi inviati. \n\n Questo è solo un assaggio delle tecnologie utilizzate, sempre in sintonia con le ultime novità del mondo della programmazione web."
            },
            {
                "title": "Impaginazione e navigazione",
                "text": "L'impaginazione è progettata per una navigazione intuitiva: \n l'homepage decisamente minimalista, presenta senza perdite di tempo il fulcro della pagina: 5 bottoni esagonali che fungono da gateway verso le altre sezioni. \n\n 6Ogni pagina, seguendo uno schema coerente, presenta un header, un corpo centrale e un footer dedicato alla navigazione. Questa struttura uniforme offre una familiarità costante, rendendo la navigazione fluida e agevole per gli utenti. \n\n L'header fornisce un acnoraggio visivo costante con il mio nome, un'icona per cambiare il tema e le opzioni di multilingua, assicurando un design pulito e funzionale. \n Il corpo centrale offre dettagli specifici sulla sezione in esame, mentre il footer, con opzioni per la pagina precedente, successiva e il ritorno alla homepage, consente una navigazione senza sforzo tra le diverse sezioni del portfolio. \n\n Questa impaginazione intuitiva mira a garantire una user experience coesa, permettendo agli utenti di esplorare agevolmente il mio progetto con una struttura chiara e uniforme."
            },
            {
                "title": "Design responsivo: un'esperienza fluida su ogni schermo",
                "text": "Al centro del mio portfolio si manifesta l'impegno per un'esperienza utente fluida e accessibile su ogni dispositivo. La base di questo approccio è il design responsivo, progettato per garantire una visualizzazione ottimale su smartphone, tablet, laptop e desktop. La filosofia 'mobile first' guida il processo, ponendo particolare attenzione all'instaurazione di un'interfaccia intuitiva per i dispositivi mobile, garantendo navigazione ed interazione ottimali anche su schermi più piccoli. \n\n Attraverso l'uso di mixin personalizzati posso sfruttare con precisione i quattro viewport, adattando dimensioni e disposizione degli elementi per massimizzare la fruibilità. Lo sviluppo responsivo non è solo una reazione alle dimensioni dello schermo, ma una considerazione attenta dell'esperienza utente. Grazie a un design fluido, il portfolio si adatta con naturalezza a una varietà di contesti, assicurando che ogni visitatore possa esplorare il mio lavoro in modo intuitivo, indipendentemente dal dispositivo utilizzato. \n\n Ogni componente è accuratamente plasmato per assicurare una presentazione accattivante su tutti i dispositivi. In un mondo digitale in continua evoluzione, il responsive design è cruciale per mantenere un'esperienza coesa e coinvolgente, rendendo il mio portfolio accessibile a una vasta gamma di utenti, ovunque essi si trovino."
            },
            {
                "title": "Accessibilità e scalabilità: la scelta del REM",
                "text": "Nel mio approccio alla progettazione web, scelgo l'uso dei REM per definire le dimensioni del testo. Questa scelta non solo ottimizza l'accessibilità, agevolando l'esperienza di tutti gli utenti, ma garantisce anche una scalabilità naturale su diverse piattaforme. Optando per i REM, cerco di creare un design adatto a ogni dimensione di schermo e alle esigenze di utenti ipovedenti."
            },
            {
                "title": "Non ci saranno sventolii di Material o stupide classi di Bootstrap nel mio portfolio.",
                "text": "Fin dall'inizio, ho scelto un percorso diverso per questo progetto. Preferisco evitare l'uso massiccio di framework preconfezionati, trovando che le loro classi siano spesso invasive. \nLa libertà di progettare uno stile unico è essenziale, e credo che Material e Bootstrap siano più adatti quando la grafica del sito è pensata per adattarsi al loro stile predefinito, e quindi non consoni ad un progetto personalizzato."
            },
            {
                "title": "Ottimizzato e stiloso",
                "text": "L'arte di definire stili personalizzati per ciascun componente si unisce a un approccio strategico di ottimizzazione dei fogli di stile. Ogni componente ha il proprio stile distintivo, ma per garantire efficienza e coerenza, gli stili comuni sono centralizzati in file SCSS dedicati: questi file SCSS vengono condivisi importandoli in styles.scss, e garantiscono efficienza e coerenza per un design uniforme. \n L'importanza di questa pratica risiede nella sua comodità e nel risparmio di risorse. Gli stili dichiarati una sola volta diventano immediatamente disponibili a tutti i componenti senza la necessità di duplicazioni inutili. \n\n Questo approccio non solo semplifica la manutenzione e l'aggiornamento degli stili, ma garantisce anche coerenza visiva in tutto il portfolio. Quando nuovi componenti si integrano nel sistema, possono beneficiare istantaneamente degli stili già esistenti, riducendo il tempo di sviluppo e garantendo uniformità nel design. \n\n L'ottimizzazione dei fogli di stile non è solo una questione di efficienza tecnica, ma un elemento chiave per mantenere uno stile coerente e professionale in tutte le pagine del mio portfolio. Un'organizzazione intelligente degli stili consolida la gestione complessiva del design, dimostrando come la praticità si unisca all'eleganza in ogni aspetto dello sviluppo web."
            },
            {
                "title": "GitHub: trasparenza e sicurezza",
                "text": "La trasparenza nel mio processo di sviluppo è una priorità, motivo per cui puoi esplorare il codice del mio portfolio su GitHub. Durante lo sviluppo, ho mantenuto un approccio organizzato utilizzando commit e branch dedicati. \n\n GitHub diventa così un ulteriore dietro le quinte del mio progetto. I commit riflettono le varie fasi dello sviluppo, consentendo di seguire l'evoluzione del codice. I branch, utilizzati in modo strategico, evidenziano le diverse funzionalità implementate o le correzioni apportate. \n\n Questa pratica non solo facilita il controllo del codice, ma dimostra anche impegno e trasparenza nella gestione del progetto. Spero che esplorare il mio repository su GitHub aggiunga un livello maggiore di comprensione e fiducia nel processo di sviluppo dietro il mio portfolio."
            }
        ]
    },
    "contact_me": {
        "title": "Contattami",
        "intro": "Hai domande o suggerimenti? Compila la form per una rapida risposta",
        "form": {
            "your_name": "Tuo nome",
            "your_email": "Tua email",
            "subject": "Oggetto della mail",
            "message": "Tuo messaggio",
            "button": "Invia mail"
        }
    }
}
