{
    "homepage": {
        "intro": "Scopri il mio percorso e i progetti nel mio portfolio. Esplora il mio mondo creativo e le competenze attraverso una varietà di progetti e realizzazioni.",
        "return_button": "Torna alla Homepage",
        "privacy-banner": "Questo sito sfrutta il localstorage per salvare le tue preferenze, non verranno richiesti dati personali e non è previsto l'uso dei cookies"
    },
    "about_me": {
        "title": "Chi sono",
        "intro": "Un'occhiata al mio percorso, tra codice e passioni",
        "bio":[
            {
                "title": "Background e formazione",
                "text": "La mia avventura nel mondo dello sviluppo è iniziata a 15 anni, quando HTML4 e CSS2 dominavano la scena digitale. I primi passi li ho fatti creando componenti per i portali su ForumFree, ForumCommunity e, di tanto in tanto, anche su MySpace. \n Nel 2020 ho preso una decisione significativa: iscrivermi al corso di Boolean Careers, che prometteva di formare Full Stack Web Developer da zero.\n\nDa quel momento, la mia passione per il coding si è trasformata in un percorso di formazione strutturato. Durante il corso ho acquisito competenze approfondite e, successivamente, ho scelto di specializzarmi nel frontend, completando ulteriori corsi, tra cui due focalizzati sul SEO. Dal 2021, ho avuto l'opportunità di lavorare in team su progetti Angular, che ad oggi considero il mio cavallo di battaglia.\n\nQuesto percorso di crescita continua è alimentato dalla curiosità e dalla voglia di apprendere sempre di più nel vasto universo dello sviluppo web, per cui sto continuando a seguire corsi dedicati. La creazione di questo portfolio nasce anche dalla mia volontà di mettere in pratica ciò che ho imparato negli ultimi anni. Il passaggio dal lavoro in team al lavoro individuale mi ha permesso di approfondire parti di Angular solitamente gestite da altri colleghi."
            },
            {
                "title": "Filosofia di lavoro",
                "text": "Nel mio approccio al lavoro, sono sempre alla ricerca di nuovi spunti e soluzioni nel mondo dello sviluppo web. Mi piace confrontarmi con diverse prospettive e chiedere il parere di colleghi e amici, e recentemente ho trovato in ChatGPT un ottimo compagno di studi, capace di consigliarmi come approcciarmi a diverse situazioni e allo stesso tempo in grado di crearmi degli esercizi per migliorare le mie competenze.\n\nDurante il mio percorso, ho adottato come mantra una semplice affermazione di uno dei miei docenti in Boolean, che il primo giorno quasi per caso disse 'Sempre formarsi'. Solo due parole, che però mi segnai subito nel mio quaderno e che ancora mi porto dietro, un promemoria costante a mantenere vivo il desiderio di apprendere e crescere professionalmente."
            },
            {
                "title": "Obiettivi futuri",
                "text": "Nel corso del 2021 ho iniziato un corso su React, ma a causa di alcune dinamiche lavorative ho dovuto interromperlo, anche se mi piacerebbe riprenderlo e usarlo per un paio di progetti personali, considerandolo una tecnologia di grande rilevanza nel mondo dello sviluppo web. Sono certo che sarebbe un'importante freccia al mio arco. \n\nInoltre, mi piacerebbe anche approfondire l'ambito dell'UX/UI; la progettazione dell'esperienza utente e dell'interfaccia è un elemento cruciale per il successo di qualsiasi progetto, e ritengo che investire del tempo in questo settore possa contribuire significativamente alla mia crescita professionale, dato che i frontendisti lavorano a stretto contatto con i web designer."
            },
            {
                "title": "Hobby",
                "text": "Al di fuori del mondo del coding, trovo il mio rifugio nella lettura, esplorando generi come fantasy, fantascienza, storici e gialli, e ultimamente ho riscoperto con piacere i libri gioco.\nAmo i giochi da tavolo, pratico scherma rinascimentale, pesca sportiva, trekking e tiro con l'arco.\nE ovviamente non possono mancare i miei gatti, compagni più che preziosi nel tempo che passo a casa, nonché assidui controllori di praticamente qualsiasi faccenda domestica, quando non cercano di mangiarmi il cavo del mouse."
            }
        ]
    },
    "projects": {
        "title": "Progetti",
        "intro": "Esplora il mio percorso nel mondo dello sviluppo web attraverso i progetti che ho realizzato",
        "subtitle": "Ogni progetto in cui ho collaborato ha un bottone per visitare il sito, mentre i progetti a cui ho lavorato individualmente hanno anche un bottone che porta al repository github associato",
        "visit_the_site": "Visita il sito",
        "explore_the_code": "Esplora il codice"
    },
    "certificates": {
        "title": "Attestati",
        "intro": "Scopri i riconoscimenti che testimoniano il mio impegno costante e la crescita nel settore",
        "download_file": "Scarica l'attestato"
    },
    "details": {
        "title": "Dietro le quinte",
        "intro": "Il backstage del mio portfolio: curiosità e scelte di sviluppo",
        "timeline": [
            {
                "title": "Il mio portfolio: powered by Angular",
                "text": "La scelta di sviluppare questo portfolio con Angular mira ad evidenziare le mie competenze come sviluppatore. Angular offre un ambiente robusto e scalabile, permettendomi di mostrare appieno le mie abilità nella creazione di progetti web avanzati e dinamici."
            },
            {
                "title": "L'arsenale di sviluppo",
                "text": "Questo portfolio è stato creato utilizzando HTML5 per una solida struttura, CSS3 per uno stile curato e una gestione avanzata dei fogli di stile, mentre TypeScript è stato impiegato per garantire affidabilità e robustezza al codice. \n Questo costituisce solo un'introduzione alle tecnologie adoperate, anticipando approfondimenti sulle librerie e gli strumenti utilizzati."
            },
            {
                "title": "Impaginazione e navigazione",
                "text": "L'impaginazione assicura un'esperienza intuitiva, con un'homepage minimalista che presenta 5 bottoni esagonali come gateway alle sezioni. \n Ogni pagina segue uno schema coerente: header con nome e opzioni, corpo centrale con dettagli specifici, e footer per una navigazione senza sforzo tra sezioni."
            },
            {
                "title": "Struttura coerente per un'esplorazione agevole",
                "text": "Ho optato per una struttura particolare ma uniforme, rendendo la navigazione fluida, con un'impaginazione mirata a garantire un'esperienza coesa, permettendo agli utenti di esplorare il progetto in modo agevole e strutturato."
            },
            {
                "title": "Design responsivo: un'esperienza fluida su ogni schermo",
                "text": "Con un approccio 'mobile first', il design responsivo garantisce un'esperienza ottimale su ogni dispositivo: mixin personalizzati e attenta considerazione dell'esperienza utente consentono al mio progetto di adattarsi in modo naturale ai vari viewport, assicurando un'esplorazione intuitiva su qualsiasi dispositivo."
            },
            {
                "title": "Accessibilità e scalabilità: la scelta del REM",
                "text": "Nel mio approccio alla progettazione web, scelgo l'uso dei REM per definire le dimensioni del testo. Questa scelta non solo ottimizza l'accessibilità, agevolando l'esperienza di tutti gli utenti, ma garantisce anche una scalabilità naturale su diverse piattaforme. Optando per i REM, cerco di creare un design adatto a ogni dimensione di schermo e alle esigenze di utenti ipovedenti."
            },
            {
                "title": "Non ci saranno sventolii di Material o stupide classi di Bootstrap nel mio portfolio",
                "text": "Fin dall'inizio, ho scelto un percorso diverso per questo progetto. Preferisco evitare l'uso massiccio di framework preconfezionati, trovando che le loro classi siano spesso invasive. \nLa libertà di progettare uno stile unico è essenziale, e credo che Material e Bootstrap siano più adatti quando la grafica del sito è pensata per adattarsi al loro stile predefinito, e quindi non consoni ad un progetto personalizzato."
            },
            {
                "title": "Ottimizzato e stiloso",
                "text": "Definire stili personalizzati e ottimizzare i fogli di stile è essenziale. \n File SCSS centralizzati in styles.scss garantiscono efficienza e coerenza, semplificando la manutenzione. \n Nuovi componenti beneficiano degli stili esistenti, riducendo il tempo di sviluppo. \n L'ottimizzazione è cruciale per uno stile coerente e professionale, dimostrando la connessione tra praticità ed eleganza nello sviluppo web."
            },
            {
                "title": "GitHub: trasparenza e sicurezza",
                "text": "Commit organizzati e branch dedicati riflettono le fasi e le funzionalità implementate. \n Questa pratica agevola il controllo del codice, dimostrando impegno e trasparenza nella gestione del progetto. \n Esplorare il mio repository su GitHub aggiunge comprensione e fiducia nel processo di sviluppo."
            },
            {
                "title": "Gestione avanzata dei branch per un'efficienza massima",
                "text": "Sviluppo con due branch principali: master per il deploy stabile e stage per lo sviluppo attivo. \n Stage è collegato a un ambiente online per la verifica pre-deploy. \n Mantenendo master stabile, sono sicuro di non pubblicare modifiche indesiderate. \n Quando stage è sicuro, lo mergio in master per pubblicare le nuove funzionalità anche sul sito in produzione."
            },
            {
                "title": "Gestione email senza backend: EmailJS",
                "text": "La form nella pagina Contattami sfrutta la libreria EmailJS per semplificare l'invio di email senza dover lavorare anche al backend. \n Una soluzione comoda che libera tempo per concentrarmi sul resto del progetto."
            },
            {
                "title": "Portfolio internazionale: l'esperienza del multilingua",
                "text": "Al fine di accogliere un pubblico internazionale, ho introdotto la gestione multilingue nel mio portfolio mediante l'utilizzo di ngx-translate. \n Questa libreria facilita una transizione linguistica fluida, permettendo una traduzione agevole del contenuto sia in italiano che in inglese. \n Questa scelta mira a migliorare l'accessibilità del mio progetto, assicurando un'esperienza utente inclusiva e globale."
            },
            {
                "title": "Tra chiaro e scuro: tua scelta, tuo stile",
                "text": "Scopri la flessibilità visiva nel mio spazio online. Con un design personalizzato, attiva il tema chiaro cliccando sul sole o passa al tema scuro cliccando sulla luna. \n Una funzionalità sviluppata per adattarsi alle tue preferenze e offrirti un ambiente visivo confortevole durante la navigazione."
            },
            {
                "title": "Solo LocalStorage",
                "text": "La mia scelta di preservare la privacy: zero cookie, solo local storage. \n Utilizzo questa tecnica per salvare solo le preferenze dell'utente, come la scelta tra tema chiaro o scuro e la lingua selezionata. \n Un approccio al rispetto della privacy, garantendo un'esperienza personalizzata senza rinunciare alla sicurezza."
            },
            {
                "title": "Il portfolio è solo l'inizio!",
                "text": "Tutto questo è solo un assaggio delle mie competenze, ci sono ancora numerosi progetti da esplorare e implementazioni da realizzare per rendere questo portfolio sempre più ricco e dinamico."
            }
        ]
    },
    "contact_me": {
        "title": "Contattami",
        "intro": "Hai domande o suggerimenti? Compila la form per una rapida risposta",
        "mail_sent": "Grazie per il tuo messaggio! Risponderò presto.",
        "form": {
            "your_name": "Tuo nome",
            "your_email": "Tua email",
            "email_validation": "Devi inserire un indirizzo email valido",
            "subject": "Oggetto della mail",
            "message": "Tuo messaggio",
            "button": "Invia mail",
            "error_message": "I dati che hai inserito non sono corretti, riprova"
        }
    }
}
